{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<eos>": 1,
      "<unk>": 2,
      "!": 3,
      "\"": 4,
      "#": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "隆": 97,
      "垄": 98,
      "拢": 99,
      "陇": 100,
      "楼": 101,
      "娄": 102,
      "搂": 103,
      "篓": 104,
      "漏": 105,
      "陋": 106,
      "芦": 107,
      "卢": 108,
      "庐": 109,
      "炉": 110,
      "掳": 111,
      "卤": 112,
      "虏": 113,
      "鲁": 114,
      "麓": 115,
      "碌": 116,
      "露": 117,
      "路": 118,
      "赂": 119,
      "鹿": 120,
      "潞": 121,
      "禄": 122,
      "录": 123,
      "陆": 124,
      "戮": 125,
      "驴": 126,
      "脌": 127,
      "脕": 128,
      "脗": 129,
      "脙": 130,
      "脛": 131,
      "脜": 132,
      "脝": 133,
      "脟": 134,
      "脠": 135,
      "脡": 136,
      "脢": 137,
      "脣": 138,
      "脤": 139,
      "脥": 140,
      "脦": 141,
      "脧": 142,
      "脨": 143,
      "脩": 144,
      "脪": 145,
      "脫": 146,
      "脭": 147,
      "脮": 148,
      "脰": 149,
      "脳": 150,
      "脴": 151,
      "脵": 152,
      "脷": 153,
      "脹": 154,
      "脺": 155,
      "脻": 156,
      "脼": 157,
      "脽": 158,
      "脿": 159,
      "谩": 160,
      "芒": 161,
      "茫": 162,
      "盲": 163,
      "氓": 164,
      "忙": 165,
      "莽": 166,
      "猫": 167,
      "茅": 168,
      "锚": 169,
      "毛": 170,
      "矛": 171,
      "铆": 172,
      "卯": 173,
      "茂": 174,
      "冒": 175,
      "帽": 176,
      "貌": 177,
      "贸": 178,
      "么": 179,
      "玫": 180,
      "枚": 181,
      "梅": 182,
      "酶": 183,
      "霉": 184,
      "煤": 185,
      "没": 186,
      "眉": 187,
      "媒": 188,
      "镁": 189,
      "每": 190,
      "膧": 191,
      "膩": 192,
      "膫": 193,
      "膬": 194,
      "膭": 195,
      "膮": 196,
      "膯": 197,
      "膰": 198,
      "膱": 199,
      "膲": 200,
      "膴": 201,
      "膵": 202,
      "膶": 203,
      "膷": 204,
      "膸": 205,
      "膹": 206,
      "膼": 207,
      "膽": 208,
      "膾": 209,
      "膿": 210,
      "臄": 211,
      "臅": 212,
      "臇": 213,
      "臈": 214,
      "臉": 215,
      "臋": 216,
      "臍": 217,
      "臎": 218,
      "臏": 219,
      "臐": 220,
      "臑": 221,
      "臒": 222,
      "臓": 223,
      "摹": 224,
      "蘑": 225,
      "模": 226,
      "膜": 227,
      "磨": 228,
      "摩": 229,
      "魔": 230,
      "抹": 231,
      "末": 232,
      "莫": 233,
      "墨": 234,
      "默": 235,
      "沫": 236,
      "漠": 237,
      "寞": 238,
      "陌": 239,
      "谋": 240,
      "牟": 241,
      "某": 242,
      "拇": 243,
      "牡": 244,
      "亩": 245,
      "姆": 246,
      "母": 247,
      "墓": 248,
      "暮": 249,
      "幕": 250,
      "募": 251,
      "慕": 252,
      "木": 253,
      "目": 254,
      "艀": 255,
      "艁": 256,
      "艂": 257,
      "艃": 258,
      "臓x": 259,
      "09": 260,
      "02": 261,
      "00": 262,
      "01": 263,
      "63": 264,
      "04": 265,
      "37": 266,
      "05": 267,
      "48": 268,
      "03": 269,
      "26": 270,
      "54": 271,
      "13": 272,
      "29": 273,
      "24": 274,
      "38": 275,
      "06": 276,
      "65": 277,
      "31": 278,
      "07": 279,
      "33": 280,
      "12": 281,
      "21": 282,
      "61": 283,
      "35": 284,
      "44": 285,
      "32": 286,
      "73": 287,
      "10": 288,
      "28": 289,
      "14": 290,
      "72": 291,
      "40": 292,
      "17": 293,
      "52": 294,
      "51": 295,
      "36": 296,
      "42": 297,
      "45": 298,
      "34": 299,
      "08": 300,
      "66": 301,
      "59": 302,
      "23": 303,
      "16": 304,
      "74": 305,
      "62": 306,
      "20": 307,
      "75": 308,
      "70": 309,
      "11": 310,
      "25": 311,
      "27": 312,
      "18": 313,
      "55": 314,
      "57": 315,
      "50": 316,
      "46": 317,
      "64": 318,
      "77": 319,
      "22": 320,
      "47": 321,
      "76": 322,
      "19": 323,
      "68": 324,
      "78": 325,
      "15": 326,
      "56": 327,
      "49": 328,
      "79": 329,
      "71": 330,
      "53": 331,
      "58": 332,
      "30": 333,
      "69": 334,
      "67": 335,
      "39": 336,
      "41": 337,
      "43": 338,
      "60": 339
    },
    "merges": [
      [
        "臓",
        "x"
      ],
      [
        "0",
        "9"
      ],
      [
        "0",
        "2"
      ],
      [
        "0",
        "0"
      ],
      [
        "0",
        "1"
      ],
      [
        "6",
        "3"
      ],
      [
        "0",
        "4"
      ],
      [
        "3",
        "7"
      ],
      [
        "0",
        "5"
      ],
      [
        "4",
        "8"
      ],
      [
        "0",
        "3"
      ],
      [
        "2",
        "6"
      ],
      [
        "5",
        "4"
      ],
      [
        "1",
        "3"
      ],
      [
        "2",
        "9"
      ],
      [
        "2",
        "4"
      ],
      [
        "3",
        "8"
      ],
      [
        "0",
        "6"
      ],
      [
        "6",
        "5"
      ],
      [
        "3",
        "1"
      ],
      [
        "0",
        "7"
      ],
      [
        "3",
        "3"
      ],
      [
        "1",
        "2"
      ],
      [
        "2",
        "1"
      ],
      [
        "6",
        "1"
      ],
      [
        "3",
        "5"
      ],
      [
        "4",
        "4"
      ],
      [
        "3",
        "2"
      ],
      [
        "7",
        "3"
      ],
      [
        "1",
        "0"
      ],
      [
        "2",
        "8"
      ],
      [
        "1",
        "4"
      ],
      [
        "7",
        "2"
      ],
      [
        "4",
        "0"
      ],
      [
        "1",
        "7"
      ],
      [
        "5",
        "2"
      ],
      [
        "5",
        "1"
      ],
      [
        "3",
        "6"
      ],
      [
        "4",
        "2"
      ],
      [
        "4",
        "5"
      ],
      [
        "3",
        "4"
      ],
      [
        "0",
        "8"
      ],
      [
        "6",
        "6"
      ],
      [
        "5",
        "9"
      ],
      [
        "2",
        "3"
      ],
      [
        "1",
        "6"
      ],
      [
        "7",
        "4"
      ],
      [
        "6",
        "2"
      ],
      [
        "2",
        "0"
      ],
      [
        "7",
        "5"
      ],
      [
        "7",
        "0"
      ],
      [
        "1",
        "1"
      ],
      [
        "2",
        "5"
      ],
      [
        "2",
        "7"
      ],
      [
        "1",
        "8"
      ],
      [
        "5",
        "5"
      ],
      [
        "5",
        "7"
      ],
      [
        "5",
        "0"
      ],
      [
        "4",
        "6"
      ],
      [
        "6",
        "4"
      ],
      [
        "7",
        "7"
      ],
      [
        "2",
        "2"
      ],
      [
        "4",
        "7"
      ],
      [
        "7",
        "6"
      ],
      [
        "1",
        "9"
      ],
      [
        "6",
        "8"
      ],
      [
        "7",
        "8"
      ],
      [
        "1",
        "5"
      ],
      [
        "5",
        "6"
      ],
      [
        "4",
        "9"
      ],
      [
        "7",
        "9"
      ],
      [
        "7",
        "1"
      ],
      [
        "5",
        "3"
      ],
      [
        "5",
        "8"
      ],
      [
        "3",
        "0"
      ],
      [
        "6",
        "9"
      ],
      [
        "6",
        "7"
      ],
      [
        "3",
        "9"
      ],
      [
        "4",
        "1"
      ],
      [
        "4",
        "3"
      ],
      [
        "6",
        "0"
      ]
    ]
  }
}