{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<eos>": 1,
      "<unk>": 2,
      "!": 3,
      "\"": 4,
      "#": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "ВЎ": 97,
      "Вў": 98,
      "ВЈ": 99,
      "ВӨ": 100,
      "ВҘ": 101,
      "ВҰ": 102,
      "В§": 103,
      "ВЁ": 104,
      "В©": 105,
      "ВӘ": 106,
      "В«": 107,
      "В¬": 108,
      "В®": 109,
      "ВҜ": 110,
      "В°": 111,
      "Вұ": 112,
      "ВІ": 113,
      "Ві": 114,
      "Вҙ": 115,
      "Вө": 116,
      "В¶": 117,
      "В·": 118,
      "Вё": 119,
      "В№": 120,
      "Вә": 121,
      "В»": 122,
      "Вј": 123,
      "ВҪ": 124,
      "Вҫ": 125,
      "Вҝ": 126,
      "ГҖ": 127,
      "ГҒ": 128,
      "ГӮ": 129,
      "Гғ": 130,
      "Г„": 131,
      "Г…": 132,
      "ГҶ": 133,
      "ГҮ": 134,
      "ГҲ": 135,
      "Гү": 136,
      "ГҠ": 137,
      "ГӢ": 138,
      "ГҢ": 139,
      "ГҚ": 140,
      "ГҺ": 141,
      "ГҸ": 142,
      "Гҗ": 143,
      "Г‘": 144,
      "Г’": 145,
      "Г“": 146,
      "Г”": 147,
      "Г•": 148,
      "Г–": 149,
      "Г—": 150,
      "Гҳ": 151,
      "Гҷ": 152,
      "Гҡ": 153,
      "Гӣ": 154,
      "Гң": 155,
      "Гқ": 156,
      "Гһ": 157,
      "Гҹ": 158,
      "Г ": 159,
      "ГЎ": 160,
      "Гў": 161,
      "ГЈ": 162,
      "ГӨ": 163,
      "ГҘ": 164,
      "ГҰ": 165,
      "Г§": 166,
      "ГЁ": 167,
      "Г©": 168,
      "ГӘ": 169,
      "Г«": 170,
      "Г¬": 171,
      "Гӯ": 172,
      "Г®": 173,
      "ГҜ": 174,
      "Г°": 175,
      "Гұ": 176,
      "ГІ": 177,
      "Гі": 178,
      "Гҙ": 179,
      "Гө": 180,
      "Г¶": 181,
      "Г·": 182,
      "Гё": 183,
      "Г№": 184,
      "Гә": 185,
      "Г»": 186,
      "Гј": 187,
      "ГҪ": 188,
      "Гҫ": 189,
      "Гҝ": 190,
      "ДҖ": 191,
      "ДҒ": 192,
      "ДӮ": 193,
      "Дғ": 194,
      "Д„": 195,
      "Д…": 196,
      "ДҶ": 197,
      "ДҮ": 198,
      "ДҲ": 199,
      "Дү": 200,
      "ДҠ": 201,
      "ДӢ": 202,
      "ДҢ": 203,
      "ДҚ": 204,
      "ДҺ": 205,
      "ДҸ": 206,
      "Дҗ": 207,
      "Д‘": 208,
      "Д’": 209,
      "Д“": 210,
      "Д”": 211,
      "Д•": 212,
      "Д–": 213,
      "Д—": 214,
      "Дҳ": 215,
      "Дҷ": 216,
      "Дҡ": 217,
      "Дӣ": 218,
      "Дң": 219,
      "Дқ": 220,
      "Дһ": 221,
      "Дҹ": 222,
      "Д ": 223,
      "ДЎ": 224,
      "Дў": 225,
      "ДЈ": 226,
      "ДӨ": 227,
      "ДҘ": 228,
      "ДҰ": 229,
      "Д§": 230,
      "ДЁ": 231,
      "Д©": 232,
      "ДӘ": 233,
      "Д«": 234,
      "Д¬": 235,
      "Дӯ": 236,
      "Д®": 237,
      "ДҜ": 238,
      "Д°": 239,
      "Дұ": 240,
      "ДІ": 241,
      "Ді": 242,
      "Дҙ": 243,
      "Дө": 244,
      "Д¶": 245,
      "Д·": 246,
      "Дё": 247,
      "Д№": 248,
      "Дә": 249,
      "Д»": 250,
      "Дј": 251,
      "ДҪ": 252,
      "Дҫ": 253,
      "Дҝ": 254,
      "ЕҖ": 255,
      "ЕҒ": 256,
      "ЕӮ": 257,
      "Еғ": 258,
      "Д x": 259,
      "Д xC": 260,
      "Д xA": 261,
      "Д xE": 262,
      "Д xD": 263,
      "Д xF": 264,
      "Д xB": 265,
      "Д xAE": 266,
      "19": 267,
      "50": 268,
      "09": 269,
      "Д xEA": 270,
      "80": 271,
      "64": 272,
      "26": 273,
      "08": 274,
      "Д xEE": 275,
      "Д xCC": 276,
      "22": 277,
      "Д xDB": 278,
      "99": 279,
      "60": 280,
      "32": 281,
      "72": 282,
      "Д xBA": 283,
      "20": 284,
      "21": 285,
      "12": 286,
      "70": 287,
      "89": 288,
      "07": 289,
      "Д xFD": 290,
      "28": 291,
      "67": 292,
      "02": 293,
      "69": 294,
      "87": 295,
      "17": 296,
      "97": 297,
      "Д xBC": 298,
      "03": 299,
      "42": 300,
      "27": 301,
      "Д xDA": 302,
      "Д xCD": 303,
      "55": 304,
      "Д xCF": 305,
      "04": 306,
      "Д xCE": 307,
      "11": 308,
      "73": 309,
      "68": 310,
      "79": 311,
      "23": 312,
      "16": 313,
      "Д xAD": 314,
      "39": 315,
      "Д xAF": 316,
      "94": 317,
      "37": 318,
      "90": 319,
      "15": 320,
      "54": 321,
      "Д xBF": 322,
      "82": 323,
      "84": 324,
      "Д xCB": 325,
      "36": 326,
      "29": 327,
      "85": 328,
      "34": 329,
      "65": 330,
      "66": 331,
      "93": 332,
      "Д xBE": 333,
      "46": 334,
      "Д xED": 335,
      "33": 336,
      "41": 337,
      "88": 338,
      "45": 339,
      "98": 340,
      "62": 341,
      "51": 342,
      "52": 343,
      "86": 344,
      "77": 345,
      "31": 346,
      "Д xEF": 347,
      "30": 348,
      "06": 349,
      "10": 350,
      "59": 351,
      "91": 352,
      "63": 353,
      "49": 354,
      "Д xEC": 355,
      "Д xFF": 356,
      "Д xAC": 357,
      "61": 358,
      "76": 359,
      "40": 360,
      "75": 361,
      "Д xDE": 362,
      "00": 363,
      "44": 364,
      "14": 365,
      "25": 366,
      "57": 367,
      "Д xAA": 368,
      "05": 369,
      "56": 370,
      "Д xCA": 371,
      "Д xDF": 372,
      "78": 373,
      "48": 374,
      "Д xDD": 375,
      "83": 376,
      "Д xAB": 377,
      "18": 378,
      "Д xFA": 379,
      "Д xFC": 380,
      "Д xDC": 381,
      "43": 382,
      "38": 383,
      "74": 384,
      "58": 385,
      "47": 386,
      "13": 387,
      "92": 388,
      "81": 389,
      "24": 390,
      "Д xFB": 391,
      "01": 392,
      "53": 393,
      "Д xBB": 394,
      "Д xFE": 395,
      "35": 396,
      "96": 397,
      "95": 398,
      "71": 399,
      "Д xEB": 400,
      "Д xBD": 401,
      "xC": 402,
      "xD": 403,
      "xA": 404,
      "xE": 405,
      "xF": 406,
      "xB": 407,
      "xAF": 408,
      "xCF": 409,
      "xDB": 410,
      "xEA": 411,
      "xCD": 412,
      "xEB": 413,
      "xBA": 414,
      "xCA": 415,
      "xDA": 416,
      "xAA": 417,
      "xAC": 418,
      "xFE": 419,
      "xFF": 420,
      "xAB": 421,
      "xAD": 422,
      "xEF": 423,
      "xFA": 424,
      "xCB": 425,
      "xDE": 426,
      "xEC": 427,
      "xBE": 428,
      "xCC": 429,
      "xDF": 430,
      "xFD": 431,
      "xDC": 432,
      "xED": 433,
      "xEE": 434,
      "xFB": 435,
      "xBD": 436,
      "xAE": 437,
      "xFC": 438,
      "xBC": 439,
      "xCE": 440,
      "xBB": 441,
      "xDD": 442,
      "xBF": 443
    },
    "merges": [
      [
        "Д ",
        "x"
      ],
      [
        "Д x",
        "C"
      ],
      [
        "Д x",
        "A"
      ],
      [
        "Д x",
        "E"
      ],
      [
        "Д x",
        "D"
      ],
      [
        "Д x",
        "F"
      ],
      [
        "Д x",
        "B"
      ],
      [
        "Д xA",
        "E"
      ],
      [
        "1",
        "9"
      ],
      [
        "5",
        "0"
      ],
      [
        "0",
        "9"
      ],
      [
        "Д xE",
        "A"
      ],
      [
        "8",
        "0"
      ],
      [
        "6",
        "4"
      ],
      [
        "2",
        "6"
      ],
      [
        "0",
        "8"
      ],
      [
        "Д xE",
        "E"
      ],
      [
        "Д xC",
        "C"
      ],
      [
        "2",
        "2"
      ],
      [
        "Д xD",
        "B"
      ],
      [
        "9",
        "9"
      ],
      [
        "6",
        "0"
      ],
      [
        "3",
        "2"
      ],
      [
        "7",
        "2"
      ],
      [
        "Д xB",
        "A"
      ],
      [
        "2",
        "0"
      ],
      [
        "2",
        "1"
      ],
      [
        "1",
        "2"
      ],
      [
        "7",
        "0"
      ],
      [
        "8",
        "9"
      ],
      [
        "0",
        "7"
      ],
      [
        "Д xF",
        "D"
      ],
      [
        "2",
        "8"
      ],
      [
        "6",
        "7"
      ],
      [
        "0",
        "2"
      ],
      [
        "6",
        "9"
      ],
      [
        "8",
        "7"
      ],
      [
        "1",
        "7"
      ],
      [
        "9",
        "7"
      ],
      [
        "Д xB",
        "C"
      ],
      [
        "0",
        "3"
      ],
      [
        "4",
        "2"
      ],
      [
        "2",
        "7"
      ],
      [
        "Д xD",
        "A"
      ],
      [
        "Д xC",
        "D"
      ],
      [
        "5",
        "5"
      ],
      [
        "Д xC",
        "F"
      ],
      [
        "0",
        "4"
      ],
      [
        "Д xC",
        "E"
      ],
      [
        "1",
        "1"
      ],
      [
        "7",
        "3"
      ],
      [
        "6",
        "8"
      ],
      [
        "7",
        "9"
      ],
      [
        "2",
        "3"
      ],
      [
        "1",
        "6"
      ],
      [
        "Д xA",
        "D"
      ],
      [
        "3",
        "9"
      ],
      [
        "Д xA",
        "F"
      ],
      [
        "9",
        "4"
      ],
      [
        "3",
        "7"
      ],
      [
        "9",
        "0"
      ],
      [
        "1",
        "5"
      ],
      [
        "5",
        "4"
      ],
      [
        "Д xB",
        "F"
      ],
      [
        "8",
        "2"
      ],
      [
        "8",
        "4"
      ],
      [
        "Д xC",
        "B"
      ],
      [
        "3",
        "6"
      ],
      [
        "2",
        "9"
      ],
      [
        "8",
        "5"
      ],
      [
        "3",
        "4"
      ],
      [
        "6",
        "5"
      ],
      [
        "6",
        "6"
      ],
      [
        "9",
        "3"
      ],
      [
        "Д xB",
        "E"
      ],
      [
        "4",
        "6"
      ],
      [
        "Д xE",
        "D"
      ],
      [
        "3",
        "3"
      ],
      [
        "4",
        "1"
      ],
      [
        "8",
        "8"
      ],
      [
        "4",
        "5"
      ],
      [
        "9",
        "8"
      ],
      [
        "6",
        "2"
      ],
      [
        "5",
        "1"
      ],
      [
        "5",
        "2"
      ],
      [
        "8",
        "6"
      ],
      [
        "7",
        "7"
      ],
      [
        "3",
        "1"
      ],
      [
        "Д xE",
        "F"
      ],
      [
        "3",
        "0"
      ],
      [
        "0",
        "6"
      ],
      [
        "1",
        "0"
      ],
      [
        "5",
        "9"
      ],
      [
        "9",
        "1"
      ],
      [
        "6",
        "3"
      ],
      [
        "4",
        "9"
      ],
      [
        "Д xE",
        "C"
      ],
      [
        "Д xF",
        "F"
      ],
      [
        "Д xA",
        "C"
      ],
      [
        "6",
        "1"
      ],
      [
        "7",
        "6"
      ],
      [
        "4",
        "0"
      ],
      [
        "7",
        "5"
      ],
      [
        "Д xD",
        "E"
      ],
      [
        "0",
        "0"
      ],
      [
        "4",
        "4"
      ],
      [
        "1",
        "4"
      ],
      [
        "2",
        "5"
      ],
      [
        "5",
        "7"
      ],
      [
        "Д xA",
        "A"
      ],
      [
        "0",
        "5"
      ],
      [
        "5",
        "6"
      ],
      [
        "Д xC",
        "A"
      ],
      [
        "Д xD",
        "F"
      ],
      [
        "7",
        "8"
      ],
      [
        "4",
        "8"
      ],
      [
        "Д xD",
        "D"
      ],
      [
        "8",
        "3"
      ],
      [
        "Д xA",
        "B"
      ],
      [
        "1",
        "8"
      ],
      [
        "Д xF",
        "A"
      ],
      [
        "Д xF",
        "C"
      ],
      [
        "Д xD",
        "C"
      ],
      [
        "4",
        "3"
      ],
      [
        "3",
        "8"
      ],
      [
        "7",
        "4"
      ],
      [
        "5",
        "8"
      ],
      [
        "4",
        "7"
      ],
      [
        "1",
        "3"
      ],
      [
        "9",
        "2"
      ],
      [
        "8",
        "1"
      ],
      [
        "2",
        "4"
      ],
      [
        "Д xF",
        "B"
      ],
      [
        "0",
        "1"
      ],
      [
        "5",
        "3"
      ],
      [
        "Д xB",
        "B"
      ],
      [
        "Д xF",
        "E"
      ],
      [
        "3",
        "5"
      ],
      [
        "9",
        "6"
      ],
      [
        "9",
        "5"
      ],
      [
        "7",
        "1"
      ],
      [
        "Д xE",
        "B"
      ],
      [
        "Д xB",
        "D"
      ],
      [
        "x",
        "C"
      ],
      [
        "x",
        "D"
      ],
      [
        "x",
        "A"
      ],
      [
        "x",
        "E"
      ],
      [
        "x",
        "F"
      ],
      [
        "x",
        "B"
      ],
      [
        "xA",
        "F"
      ],
      [
        "xC",
        "F"
      ],
      [
        "xD",
        "B"
      ],
      [
        "xE",
        "A"
      ],
      [
        "xC",
        "D"
      ],
      [
        "xE",
        "B"
      ],
      [
        "xB",
        "A"
      ],
      [
        "xC",
        "A"
      ],
      [
        "xD",
        "A"
      ],
      [
        "xA",
        "A"
      ],
      [
        "xA",
        "C"
      ],
      [
        "xF",
        "E"
      ],
      [
        "xF",
        "F"
      ],
      [
        "xA",
        "B"
      ],
      [
        "xA",
        "D"
      ],
      [
        "xE",
        "F"
      ],
      [
        "xF",
        "A"
      ],
      [
        "xC",
        "B"
      ],
      [
        "xD",
        "E"
      ],
      [
        "xE",
        "C"
      ],
      [
        "xB",
        "E"
      ],
      [
        "xC",
        "C"
      ],
      [
        "xD",
        "F"
      ],
      [
        "xF",
        "D"
      ],
      [
        "xD",
        "C"
      ],
      [
        "xE",
        "D"
      ],
      [
        "xE",
        "E"
      ],
      [
        "xF",
        "B"
      ],
      [
        "xB",
        "D"
      ],
      [
        "xA",
        "E"
      ],
      [
        "xF",
        "C"
      ],
      [
        "xB",
        "C"
      ],
      [
        "xC",
        "E"
      ],
      [
        "xB",
        "B"
      ],
      [
        "xD",
        "D"
      ],
      [
        "xB",
        "F"
      ]
    ]
  }
}